#include "main.h"
#include "util/patch.h"

/*
            - opengl for flame
*/

#define FLAG_ALPHA_TEST           0x01
#define FLAG_LIGHTING             0x02
#define FLAG_ALPHA_MODULATE       0x04
#define FLAG_COLOR_EMISSIVE       0x08
#define FLAG_COLOR                0x10
#define FLAG_TEX0                 0x20
#define FLAG_ENVMAP               0x40          // normal envmap
#define FLAG_BONE3                0x80
#define FLAG_BONE4                0x100
#define FLAG_CAMERA_BASED_NORMALS 0x200
#define FLAG_FOG                  0x400
#define FLAG_TEXBIAS              0x800
#define FLAG_BACKLIGHT            0x1000
#define FLAG_LIGHT1               0x2000
#define FLAG_LIGHT2               0x4000
#define FLAG_LIGHT3               0x8000
#define FLAG_DETAILMAP            0x10000
#define FLAG_COMPRESSED_TEXCOORD  0x20000
#define FLAG_PROJECT_TEXCOORD     0x40000
#define FLAG_WATER                0x80000
#define FLAG_COLOR2               0x100000
#define FLAG_SPHERE_XFORM         0x800000      // this renders the scene as a sphere map for vehicle reflections
#define FLAG_SPHERE_ENVMAP        0x1000000     // spherical real-time envmap
#define FLAG_TEXMATRIX            0x2000000
#define FLAG_GAMMA                0x4000000

typedef struct {
  // Checks for GL_OES_depth24
  char has24BitDepthCap;                   // 0x00
  // Checks for GL_OES_packed_depth_stencil
  char hasPackedDepthStencilCap;           // 0x01
  // Checks for GL_NV_depth_nonlinear
  char hasDepthNonLinearCap;               // 0x02
  // Checks for GL_EXT_texture_compression_dxt1 or GL_EXT_texture_compression_s3tc
  char hasTextureCompressionDXT1OrS3TCCap; // 0x03
  // Checks for GL_AMD_compressed_ATC_texture
  char hasTextureCompressionATCCap;        // 0x04
  // Checks for GL_IMG_texture_compression_pvrtc
  char hasTextureCompressionPVRTCCap;      // 0x05
  // Checks for GL_OES_rgb8_rgba8
  char has32BitRenderTargetCap;            // 0x06
  // Checks for GL_EXT_texture_filter_anisotropic
  char hasAnisotropicFilteringCap;         // 0x07
  // Set when OS_SystemChip() <= 1
  char unk_08;                             // 0x08
  // Always set to 0
  char unk_09;                             // 0x09
  // Checks for GL_QCOM_binning_control
  char hasBinningControlCap;               // 0x0A
  // Checks for GL_QCOM_alpha_test
  char hasAlphaTestCap;                    // 0x0B
  // Checks for Adreno (TM) 320 or GL_AMD_compressed_ATC_texture
  char isAdreno;                           // 0x0C
  // Set when there is no compression support
  char isMaliChip;                         // 0x0D
  // Checks for 225 or 540
  char isSlowGPU;                          // 0x0E
  char unk_0f;                             // 0x0F
} RQCapabilities;

RQCapabilities *RQCaps;
int *RQMaxBones;

char pxlbuf[1024 * 10];
char vtxbuf[1024 * 10];

char* byte_617290 = 0; //pxl
char* byte_617258 = 0;

char* byte_619294 = 0; //vertex

#define PXL_SOURCE(str) \
		strcat(byte_617290, str) \

#define VTX_SOURCE(str) \
        strcat(byte_619294, str) \


void (*BuildPixelSource)(unsigned int flags);
void BuildPixelSource_hook(unsigned int flags)
{
  /*char v2; // r6
  unsigned int v3; // r3
  bool v5; // r3
  const char *v6; // lr
  const char *v7; // lr
  int v8; // r0
  int v9; // r1
  int v10; // r2
  int v11; // r3
  int *v12; // lr
  int v13; // r1
  int v14; // r2
  int v15; // r3
  int v16; // r0
  int v17; // r1
  int v18; // r2
  int v19; // r3
  int *v20; // lr
  int v21; // r0
  int v22; // r1
  int v23; // r2
  int v24; // r3
  int v25; // r1
  int v26; // [sp+4h] [bp+4h]
  unsigned int v27; // [sp+8h] [bp+8h]
  unsigned int v28; // [sp+Ch] [bp+Ch]
